      *01  WS-AGENT-NOTIFY-RECORD.  
           05 AN-AGENT-CODE          PIC X(10).  
           05 AN-AGENT-NAME          PIC X(45).  
           05 AN-AGENT-ADDRESS-1     PIC X(50).  
           05 AN-AGENT-ADDRESS-2     PIC X(50).  
           05 AN-AGENT-CITY          PIC X(20).  
           05 AN-AGENT-STATE         PIC X(2).  
           05 AN-POLICY-NUMBER       PIC X(10).  
           05 AN-POLICY-HOLDER-FNAME PIC X(35).  
           05 AN-POLICY-HOLDER-MNAME PIC X(1).  
           05 AN-POLICY-HOLDER-LNAME PIC X(35).  
           05 AN-POLICY-START-DATE   PIC X(10).  
           05 AN-POLICY-EXPIRY-DATE  PIC X(10).  
           05 AN-NOTIFY-DATE         PIC X(10).  
           05 AN-NOTIFY-MESSAGES     PIC X(100).  
  