       01  AGENT-RECORD.  
           05 AGENT-CODE           PIC X(10).        
           05 AGENT-NAME           PIC X(45).  
           05 AGENT-ADDRESS-1      PIC X(50).  
           05 AGENT-ADDRESS-2      PIC X(50).  
           05 AGENT-CITY           PIC X(20).  
           05 AGENT-STATE          PIC X(2).
           05 AGENT-ZIP-CD         PIC X(10).
           05 AGENT-DOB            PIC X(10).
           05 AGENT-TYPE           PIC X(10).
           05 AGENT-STATUS         PIC X(1).
           05 AGENT-EMAIL          PIC X(30).           
           05 AGENT-CONTACT-NO     PIC X(10).
           05 AGENT-START-DATE     PIC X(10).
           05 AGENT-END-DATE       PIC X(10).           