      *01  WS-CUSTOMER-NOTIFY-RECORD.  
           05 CN-CUST-POLICY-NUMBER  PIC X(10).  
           05 CN-CUST-FIRST-NAME     PIC X(35).  
           05 CN-CUST-MIDDLE-NAME    PIC X(1).  
           05 CN-CUST-LAST-NAME      PIC X(35).  
           05 CN-CUST-START-DATE     PIC X(10).  
           05 CN-CUST-EXPIRY-DATE    PIC X(10).  
           05 CN-CUST-NOTIFY-DATE    PIC X(10).  
           05 CN-CUST-NOTIFY-MESSAGES PIC X(100).  
           05 CN-CUST-AGENT-CODE     PIC X(10).  
           05 CN-CUST-AGENT-NAME     PIC X(45).  
           05 CN-STATUTORY-MESSAGE   PIC X(100).  