       IDENTIFICATION DIVISION.
       PROGRAM-ID. BIGTEST300K.
       AUTHOR. Gustav-GPT.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER. GENERIC.
       OBJECT-COMPUTER. GENERIC.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  WS-COUNTER        PIC 9(9) VALUE 0.
       01  WS-DUMMY-TEXT     PIC X(80).
       PROCEDURE DIVISION.
       MAIN-SECTION.
           PERFORM INIT-SECTION
           PERFORM TEST-SECTION
           PERFORM FINISH-SECTION
           GOBACK.
       INIT-SECTION.
           MOVE "INITIALIZING 300K" TO WS-DUMMY-TEXT.
           DISPLAY WS-DUMMY-TEXT.
           MOVE 0 TO WS-COUNTER.
           EXIT.
       TEST-SECTION.
           *> BLOCK-0000001 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000001" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000001 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000001 END
           *> BLOCK-0000002 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000002" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000002 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000002 END
           *> BLOCK-0000003 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000003" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000003 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000003 END
           *> BLOCK-0000004 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000004" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000004 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000004 END
           *> BLOCK-0000005 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000005" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000005 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000005 END
           *> BLOCK-0000006 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000006" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000006 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000006 END
           *> BLOCK-0000007 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000007" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000007 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000007 END
           *> BLOCK-0000008 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000008" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000008 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000008 END
           *> BLOCK-0000009 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000009" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000009 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000009 END
           *> BLOCK-0000010 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000010" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000010 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000010 END
           *> BLOCK-0000011 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000011" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000011 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000011 END
           *> BLOCK-0000012 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000012" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000012 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000012 END
           *> BLOCK-0000013 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000013" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000013 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000013 END
           *> BLOCK-0000014 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000014" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000014 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000014 END
           *> BLOCK-0000015 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000015" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000015 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000015 END
           *> BLOCK-0000016 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000016" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000016 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000016 END
           *> BLOCK-0000017 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000017" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000017 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000017 END
           *> BLOCK-0000018 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000018" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000018 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000018 END
           *> BLOCK-0000019 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000019" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000019 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000019 END
           *> BLOCK-0000020 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000020" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000020 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000020 END
           *> BLOCK-0000021 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000021" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000021 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000021 END
           *> BLOCK-0000022 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000022" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000022 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000022 END
           *> BLOCK-0000023 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000023" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000023 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000023 END
           *> BLOCK-0000024 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000024" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000024 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000024 END
           *> BLOCK-0000025 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000025" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000025 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000025 END
           *> BLOCK-0000026 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000026" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000026 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000026 END
           *> BLOCK-0000027 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000027" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000027 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000027 END
           *> BLOCK-0000028 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000028" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000028 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000028 END
           *> BLOCK-0000029 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000029" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000029 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000029 END
           *> BLOCK-0000030 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000030" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000030 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000030 END
           *> BLOCK-0000031 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000031" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000031 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000031 END
           *> BLOCK-0000032 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000032" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000032 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000032 END
           *> BLOCK-0000033 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000033" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000033 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000033 END
           *> BLOCK-0000034 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000034" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000034 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000034 END
           *> BLOCK-0000035 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000035" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000035 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000035 END
           *> BLOCK-0000036 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000036" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000036 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000036 END
           *> BLOCK-0000037 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000037" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000037 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000037 END
           *> BLOCK-0000038 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000038" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000038 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000038 END
           *> BLOCK-0000039 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000039" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000039 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000039 END
           *> BLOCK-0000040 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000040" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000040 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000040 END
           *> BLOCK-0000041 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000041" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000041 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000041 END
           *> BLOCK-0000042 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000042" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000042 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000042 END
           *> BLOCK-0000043 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000043" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000043 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000043 END
           *> BLOCK-0000044 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000044" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000044 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000044 END
           *> BLOCK-0000045 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000045" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000045 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000045 END
           *> BLOCK-0000046 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000046" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000046 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000046 END
           *> BLOCK-0000047 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000047" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000047 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000047 END
           *> BLOCK-0000048 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000048" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000048 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000048 END
           *> BLOCK-0000049 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000049" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000049 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000049 END
           *> BLOCK-0000050 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000050" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000050 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000050 END
           *> BLOCK-0000051 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000051" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000051 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000051 END
           *> BLOCK-0000052 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000052" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000052 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000052 END
           *> BLOCK-0000053 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000053" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000053 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000053 END
           *> BLOCK-0000054 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000054" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000054 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000054 END
           *> BLOCK-0000055 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000055" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000055 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000055 END
           *> BLOCK-0000056 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000056" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000056 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000056 END
           *> BLOCK-0000057 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000057" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000057 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000057 END
           *> BLOCK-0000058 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000058" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000058 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000058 END
           *> BLOCK-0000059 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000059" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000059 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000059 END
           *> BLOCK-0000060 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000060" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000060 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000060 END
           *> BLOCK-0000061 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000061" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000061 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000061 END
           *> BLOCK-0000062 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000062" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000062 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000062 END
           *> BLOCK-0000063 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000063" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000063 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000063 END
           *> BLOCK-0000064 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000064" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000064 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000064 END
           *> BLOCK-0000065 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000065" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000065 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000065 END
           *> BLOCK-0000066 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000066" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000066 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000066 END
           *> BLOCK-0000067 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000067" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000067 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000067 END
           *> BLOCK-0000068 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000068" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000068 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000068 END
           *> BLOCK-0000069 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000069" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000069 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000069 END
           *> BLOCK-0000070 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000070" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000070 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000070 END
           *> BLOCK-0000071 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000071" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000071 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000071 END
           *> BLOCK-0000072 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000072" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000072 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000072 END
           *> BLOCK-0000073 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000073" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000073 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000073 END
           *> BLOCK-0000074 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000074" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000074 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000074 END
           *> BLOCK-0000075 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000075" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000075 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000075 END
           *> BLOCK-0000076 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000076" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000076 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000076 END
           *> BLOCK-0000077 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000077" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000077 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000077 END
           *> BLOCK-0000078 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000078" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000078 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000078 END
           *> BLOCK-0000079 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000079" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000079 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000079 END
           *> BLOCK-0000080 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000080" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000080 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000080 END
           *> BLOCK-0000081 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000081" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000081 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000081 END
           *> BLOCK-0000082 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000082" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000082 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000082 END
           *> BLOCK-0000083 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000083" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000083 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000083 END
           *> BLOCK-0000084 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000084" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000084 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000084 END
           *> BLOCK-0000085 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000085" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000085 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000085 END
           *> BLOCK-0000086 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000086" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000086 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000086 END
           *> BLOCK-0000087 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000087" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000087 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000087 END
           *> BLOCK-0000088 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000088" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000088 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000088 END
           *> BLOCK-0000089 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000089" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000089 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000089 END
           *> BLOCK-0000090 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000090" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000090 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000090 END
           *> BLOCK-0000091 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000091" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000091 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000091 END
           *> BLOCK-0000092 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000092" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000092 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000092 END
           *> BLOCK-0000093 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000093" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000093 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000093 END
           *> BLOCK-0000094 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000094" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000094 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000094 END
           *> BLOCK-0000095 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000095" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000095 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000095 END
           *> BLOCK-0000096 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000096" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000096 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000096 END
           *> BLOCK-0000097 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000097" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000097 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000097 END
           *> BLOCK-0000098 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000098" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000098 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000098 END
           *> BLOCK-0000099 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000099" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000099 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000099 END
           *> BLOCK-0000100 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000100" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000100 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000100 END
           *> BLOCK-0000101 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000101" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000101 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000101 END
           *> BLOCK-0000102 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000102" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000102 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000102 END
           *> BLOCK-0000103 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000103" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000103 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000103 END
           *> BLOCK-0000104 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000104" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000104 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000104 END
           *> BLOCK-0000105 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000105" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000105 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000105 END
           *> BLOCK-0000106 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000106" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000106 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000106 END
           *> BLOCK-0000107 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000107" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000107 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000107 END
           *> BLOCK-0000108 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000108" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000108 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000108 END
           *> BLOCK-0000109 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000109" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000109 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000109 END
           *> BLOCK-0000110 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000110" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000110 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000110 END
           *> BLOCK-0000111 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000111" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000111 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000111 END
           *> BLOCK-0000112 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000112" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000112 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000112 END
           *> BLOCK-0000113 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000113" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000113 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000113 END
           *> BLOCK-0000114 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000114" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000114 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000114 END
           *> BLOCK-0000115 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000115" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000115 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000115 END
           *> BLOCK-0000116 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000116" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000116 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000116 END
           *> BLOCK-0000117 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000117" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000117 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000117 END
           *> BLOCK-0000118 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000118" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000118 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000118 END
           *> BLOCK-0000119 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000119" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000119 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000119 END
           *> BLOCK-0000120 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000120" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000120 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000120 END
           *> BLOCK-0000121 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000121" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000121 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000121 END
           *> BLOCK-0000122 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000122" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000122 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000122 END
           *> BLOCK-0000123 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000123" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000123 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000123 END
           *> BLOCK-0000124 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000124" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000124 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000124 END
           *> BLOCK-0000125 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000125" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000125 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000125 END
           *> BLOCK-0000126 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000126" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000126 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000126 END
           *> BLOCK-0000127 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000127" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000127 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000127 END
           *> BLOCK-0000128 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000128" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000128 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000128 END
           *> BLOCK-0000129 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000129" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000129 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000129 END
           *> BLOCK-0000130 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000130" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000130 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000130 END
           *> BLOCK-0000131 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000131" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000131 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000131 END
           *> BLOCK-0000132 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000132" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000132 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000132 END
           *> BLOCK-0000133 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000133" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000133 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000133 END
           *> BLOCK-0000134 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000134" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000134 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000134 END
           *> BLOCK-0000135 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000135" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000135 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000135 END
           *> BLOCK-0000136 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000136" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000136 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000136 END
           *> BLOCK-0000137 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000137" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000137 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000137 END
           *> BLOCK-0000138 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000138" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000138 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000138 END
           *> BLOCK-0000139 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000139" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000139 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000139 END
           *> BLOCK-0000140 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000140" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000140 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000140 END
           *> BLOCK-0000141 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000141" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000141 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000141 END
           *> BLOCK-0000142 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000142" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000142 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000142 END
           *> BLOCK-0000143 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000143" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000143 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000143 END
           *> BLOCK-0000144 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000144" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000144 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000144 END
           *> BLOCK-0000145 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000145" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000145 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000145 END
           *> BLOCK-0000146 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000146" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000146 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000146 END
           *> BLOCK-0000147 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000147" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000147 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000147 END
           *> BLOCK-0000148 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000148" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000148 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000148 END
           *> BLOCK-0000149 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000149" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000149 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000149 END
           *> BLOCK-0000150 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000150" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000150 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000150 END
           *> BLOCK-0000151 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000151" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000151 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000151 END
           *> BLOCK-0000152 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000152" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000152 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000152 END
           *> BLOCK-0000153 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000153" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000153 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000153 END
           *> BLOCK-0000154 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000154" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000154 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000154 END
           *> BLOCK-0000155 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000155" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000155 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000155 END
           *> BLOCK-0000156 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000156" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000156 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000156 END
           *> BLOCK-0000157 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000157" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000157 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000157 END
           *> BLOCK-0000158 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000158" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000158 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000158 END
           *> BLOCK-0000159 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000159" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000159 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000159 END
           *> BLOCK-0000160 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000160" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000160 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000160 END
           *> BLOCK-0000161 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000161" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000161 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000161 END
           *> BLOCK-0000162 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000162" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000162 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000162 END
           *> BLOCK-0000163 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000163" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000163 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000163 END
           *> BLOCK-0000164 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000164" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000164 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000164 END
           *> BLOCK-0000165 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000165" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000165 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000165 END
           *> BLOCK-0000166 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000166" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000166 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000166 END
           *> BLOCK-0000167 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000167" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000167 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000167 END
           *> BLOCK-0000168 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000168" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000168 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000168 END
           *> BLOCK-0000169 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000169" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000169 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000169 END
           *> BLOCK-0000170 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000170" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000170 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000170 END
           *> BLOCK-0000171 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000171" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000171 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000171 END
           *> BLOCK-0000172 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000172" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000172 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000172 END
           *> BLOCK-0000173 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000173" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000173 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000173 END
           *> BLOCK-0000174 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000174" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000174 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000174 END
           *> BLOCK-0000175 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000175" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000175 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000175 END
           *> BLOCK-0000176 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000176" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000176 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000176 END
           *> BLOCK-0000177 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000177" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000177 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000177 END
           *> BLOCK-0000178 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000178" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000178 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000178 END
           *> BLOCK-0000179 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000179" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000179 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000179 END
           *> BLOCK-0000180 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000180" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000180 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000180 END
           *> BLOCK-0000181 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000181" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000181 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000181 END
           *> BLOCK-0000182 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000182" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000182 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000182 END
           *> BLOCK-0000183 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000183" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000183 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000183 END
           *> BLOCK-0000184 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000184" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000184 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000184 END
           *> BLOCK-0000185 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000185" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000185 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000185 END
           *> BLOCK-0000186 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000186" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000186 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000186 END
           *> BLOCK-0000187 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000187" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000187 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000187 END
           *> BLOCK-0000188 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000188" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000188 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000188 END
           *> BLOCK-0000189 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000189" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000189 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000189 END
           *> BLOCK-0000190 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000190" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000190 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000190 END
           *> BLOCK-0000191 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000191" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000191 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000191 END
           *> BLOCK-0000192 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000192" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000192 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000192 END
           *> BLOCK-0000193 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000193" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000193 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000193 END
           *> BLOCK-0000194 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000194" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000194 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000194 END
           *> BLOCK-0000195 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000195" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000195 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000195 END
           *> BLOCK-0000196 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000196" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000196 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000196 END
           *> BLOCK-0000197 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000197" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000197 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000197 END
           *> BLOCK-0000198 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000198" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000198 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000198 END
           *> BLOCK-0000199 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000199" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000199 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000199 END
           *> BLOCK-0000200 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000200" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000200 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000200 END
           *> BLOCK-0000201 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000201" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000201 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000201 END
           *> BLOCK-0000202 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000202" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000202 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000202 END
           *> BLOCK-0000203 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000203" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000203 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000203 END
           *> BLOCK-0000204 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000204" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000204 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000204 END
           *> BLOCK-0000205 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000205" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000205 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000205 END
           *> BLOCK-0000206 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000206" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000206 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000206 END
           *> BLOCK-0000207 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000207" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000207 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000207 END
           *> BLOCK-0000208 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000208" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000208 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000208 END
           *> BLOCK-0000209 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000209" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000209 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000209 END
           *> BLOCK-0000210 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000210" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000210 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000210 END
           *> BLOCK-0000211 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000211" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000211 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000211 END
           *> BLOCK-0000212 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000212" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000212 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000212 END
           *> BLOCK-0000213 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000213" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000213 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000213 END
           *> BLOCK-0000214 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000214" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000214 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000214 END
           *> BLOCK-0000215 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000215" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000215 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000215 END
           *> BLOCK-0000216 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000216" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000216 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000216 END
           *> BLOCK-0000217 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000217" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000217 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000217 END
           *> BLOCK-0000218 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000218" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000218 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000218 END
           *> BLOCK-0000219 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000219" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000219 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000219 END
           *> BLOCK-0000220 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000220" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000220 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000220 END
           *> BLOCK-0000221 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000221" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000221 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000221 END
           *> BLOCK-0000222 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000222" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000222 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000222 END
           *> BLOCK-0000223 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000223" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000223 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000223 END
           *> BLOCK-0000224 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000224" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000224 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000224 END
           *> BLOCK-0000225 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000225" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000225 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000225 END
           *> BLOCK-0000226 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000226" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000226 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000226 END
           *> BLOCK-0000227 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000227" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000227 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000227 END
           *> BLOCK-0000228 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000228" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000228 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000228 END
           *> BLOCK-0000229 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000229" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000229 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000229 END
           *> BLOCK-0000230 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000230" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000230 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000230 END
           *> BLOCK-0000231 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000231" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000231 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000231 END
           *> BLOCK-0000232 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000232" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000232 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000232 END
           *> BLOCK-0000233 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000233" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000233 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000233 END
           *> BLOCK-0000234 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000234" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000234 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000234 END
           *> BLOCK-0000235 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000235" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000235 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000235 END
           *> BLOCK-0000236 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000236" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000236 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000236 END
           *> BLOCK-0000237 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000237" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000237 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000237 END
           *> BLOCK-0000238 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000238" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000238 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000238 END
           *> BLOCK-0000239 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000239" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000239 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000239 END
           *> BLOCK-0000240 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000240" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000240 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000240 END
           *> BLOCK-0000241 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000241" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000241 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000241 END
           *> BLOCK-0000242 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000242" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000242 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000242 END
           *> BLOCK-0000243 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000243" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000243 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000243 END
           *> BLOCK-0000244 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000244" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000244 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000244 END
           *> BLOCK-0000245 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000245" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000245 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000245 END
           *> BLOCK-0000246 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000246" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000246 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000246 END
           *> BLOCK-0000247 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000247" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000247 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000247 END
           *> BLOCK-0000248 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000248" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000248 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000248 END
           *> BLOCK-0000249 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000249" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000249 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000249 END
           *> BLOCK-0000250 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000250" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000250 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000250 END
           *> BLOCK-0000251 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000251" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000251 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000251 END
           *> BLOCK-0000252 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000252" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000252 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000252 END
           *> BLOCK-0000253 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000253" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000253 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000253 END
           *> BLOCK-0000254 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000254" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000254 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000254 END
           *> BLOCK-0000255 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000255" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000255 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000255 END
           *> BLOCK-0000256 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000256" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000256 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000256 END
           *> BLOCK-0000257 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000257" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000257 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000257 END
           *> BLOCK-0000258 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000258" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000258 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000258 END
           *> BLOCK-0000259 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000259" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000259 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000259 END
           *> BLOCK-0000260 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000260" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000260 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000260 END
           *> BLOCK-0000261 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000261" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000261 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000261 END
           *> BLOCK-0000262 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000262" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000262 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000262 END
           *> BLOCK-0000263 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000263" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000263 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000263 END
           *> BLOCK-0000264 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000264" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000264 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000264 END
           *> BLOCK-0000265 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000265" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000265 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000265 END
           *> BLOCK-0000266 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000266" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000266 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000266 END
           *> BLOCK-0000267 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000267" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000267 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000267 END
           *> BLOCK-0000268 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000268" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000268 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000268 END
           *> BLOCK-0000269 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000269" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000269 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000269 END
           *> BLOCK-0000270 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000270" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000270 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000270 END
           *> BLOCK-0000271 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000271" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000271 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000271 END
           *> BLOCK-0000272 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000272" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000272 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000272 END
           *> BLOCK-0000273 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000273" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000273 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000273 END
           *> BLOCK-0000274 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000274" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000274 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000274 END
           *> BLOCK-0000275 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000275" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000275 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000275 END
           *> BLOCK-0000276 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000276" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000276 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000276 END
           *> BLOCK-0000277 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000277" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000277 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000277 END
           *> BLOCK-0000278 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000278" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000278 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000278 END
           *> BLOCK-0000279 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000279" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000279 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000279 END
           *> BLOCK-0000280 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000280" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000280 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000280 END
           *> BLOCK-0000281 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000281" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000281 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000281 END
           *> BLOCK-0000282 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000282" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000282 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000282 END
           *> BLOCK-0000283 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000283" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000283 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000283 END
           *> BLOCK-0000284 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000284" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000284 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000284 END
           *> BLOCK-0000285 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000285" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000285 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000285 END
           *> BLOCK-0000286 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000286" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000286 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000286 END
           *> BLOCK-0000287 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000287" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000287 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000287 END
           *> BLOCK-0000288 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000288" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000288 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000288 END
           *> BLOCK-0000289 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000289" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000289 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000289 END
           *> BLOCK-0000290 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000290" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000290 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000290 END
           *> BLOCK-0000291 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000291" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000291 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000291 END
           *> BLOCK-0000292 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000292" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000292 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000292 END
           *> BLOCK-0000293 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000293" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000293 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000293 END
           *> BLOCK-0000294 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000294" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000294 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000294 END
           *> BLOCK-0000295 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000295" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000295 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000295 END
           *> BLOCK-0000296 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000296" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000296 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000296 END
           *> BLOCK-0000297 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000297" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000297 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000297 END
           *> BLOCK-0000298 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000298" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000298 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000298 END
           *> BLOCK-0000299 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000299" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000299 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000299 END
           *> BLOCK-0000300 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000300" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000300 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000300 END
           *> BLOCK-0000301 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000301" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000301 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000301 END
           *> BLOCK-0000302 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000302" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000302 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000302 END
           *> BLOCK-0000303 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000303" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000303 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000303 END
           *> BLOCK-0000304 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000304" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000304 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000304 END
           *> BLOCK-0000305 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000305" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000305 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000305 END
           *> BLOCK-0000306 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000306" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000306 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000306 END
           *> BLOCK-0000307 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000307" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000307 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000307 END
           *> BLOCK-0000308 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000308" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000308 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000308 END
           *> BLOCK-0000309 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000309" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000309 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000309 END
           *> BLOCK-0000310 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000310" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000310 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000310 END
           *> BLOCK-0000311 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000311" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000311 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000311 END
           *> BLOCK-0000312 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000312" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000312 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000312 END
           *> BLOCK-0000313 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000313" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000313 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000313 END
           *> BLOCK-0000314 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000314" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000314 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000314 END
           *> BLOCK-0000315 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000315" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000315 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000315 END
           *> BLOCK-0000316 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000316" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000316 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000316 END
           *> BLOCK-0000317 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000317" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000317 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000317 END
           *> BLOCK-0000318 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000318" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000318 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000318 END
           *> BLOCK-0000319 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000319" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000319 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000319 END
           *> BLOCK-0000320 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000320" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000320 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000320 END
           *> BLOCK-0000321 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000321" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000321 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000321 END
           *> BLOCK-0000322 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000322" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000322 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000322 END
           *> BLOCK-0000323 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000323" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000323 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000323 END
           *> BLOCK-0000324 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000324" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000324 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000324 END
           *> BLOCK-0000325 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000325" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000325 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000325 END
           *> BLOCK-0000326 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000326" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000326 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000326 END
           *> BLOCK-0000327 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000327" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000327 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000327 END
           *> BLOCK-0000328 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000328" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000328 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000328 END
           *> BLOCK-0000329 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000329" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000329 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000329 END
           *> BLOCK-0000330 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000330" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000330 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000330 END
           *> BLOCK-0000331 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000331" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000331 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000331 END
           *> BLOCK-0000332 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000332" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000332 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000332 END
           *> BLOCK-0000333 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000333" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000333 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000333 END
           *> BLOCK-0000334 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000334" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000334 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000334 END
           *> BLOCK-0000335 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000335" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000335 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000335 END
           *> BLOCK-0000336 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000336" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000336 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000336 END
           *> BLOCK-0000337 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000337" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000337 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000337 END
           *> BLOCK-0000338 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000338" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000338 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000338 END
           *> BLOCK-0000339 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000339" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000339 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000339 END
           *> BLOCK-0000340 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000340" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000340 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000340 END
           *> BLOCK-0000341 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000341" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000341 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000341 END
           *> BLOCK-0000342 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000342" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000342 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000342 END
           *> BLOCK-0000343 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000343" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000343 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000343 END
           *> BLOCK-0000344 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000344" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000344 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000344 END
           *> BLOCK-0000345 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000345" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000345 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000345 END
           *> BLOCK-0000346 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000346" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000346 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000346 END
           *> BLOCK-0000347 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000347" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000347 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000347 END
           *> BLOCK-0000348 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000348" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000348 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000348 END
           *> BLOCK-0000349 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000349" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000349 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000349 END
           *> BLOCK-0000350 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000350" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000350 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000350 END
           *> BLOCK-0000351 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000351" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000351 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000351 END
           *> BLOCK-0000352 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000352" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000352 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000352 END
           *> BLOCK-0000353 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000353" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000353 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000353 END
           *> BLOCK-0000354 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000354" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000354 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000354 END
           *> BLOCK-0000355 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000355" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000355 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000355 END
           *> BLOCK-0000356 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000356" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000356 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000356 END
           *> BLOCK-0000357 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000357" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000357 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000357 END
           *> BLOCK-0000358 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000358" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000358 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000358 END
           *> BLOCK-0000359 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000359" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000359 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000359 END
           *> BLOCK-0000360 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000360" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000360 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000360 END
           *> BLOCK-0000361 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000361" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000361 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000361 END
           *> BLOCK-0000362 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000362" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000362 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000362 END
           *> BLOCK-0000363 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000363" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000363 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000363 END
           *> BLOCK-0000364 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000364" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000364 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000364 END
           *> BLOCK-0000365 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000365" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000365 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000365 END
           *> BLOCK-0000366 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000366" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000366 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000366 END
           *> BLOCK-0000367 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000367" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000367 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000367 END
           *> BLOCK-0000368 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000368" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000368 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000368 END
           *> BLOCK-0000369 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000369" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000369 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000369 END
           *> BLOCK-0000370 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000370" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000370 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000370 END
           *> BLOCK-0000371 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000371" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000371 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000371 END
           *> BLOCK-0000372 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000372" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000372 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000372 END
           *> BLOCK-0000373 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000373" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000373 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000373 END
           *> BLOCK-0000374 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000374" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000374 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000374 END
           *> BLOCK-0000375 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000375" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000375 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000375 END
           *> BLOCK-0000376 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000376" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000376 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000376 END
           *> BLOCK-0000377 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000377" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000377 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000377 END
           *> BLOCK-0000378 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000378" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000378 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000378 END
           *> BLOCK-0000379 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000379" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000379 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000379 END
           *> BLOCK-0000380 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000380" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000380 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000380 END
           *> BLOCK-0000381 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000381" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000381 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000381 END
           *> BLOCK-0000382 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000382" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000382 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000382 END
           *> BLOCK-0000383 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000383" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000383 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000383 END
           *> BLOCK-0000384 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000384" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000384 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000384 END
           *> BLOCK-0000385 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000385" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000385 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000385 END
           *> BLOCK-0000386 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000386" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000386 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000386 END
           *> BLOCK-0000387 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000387" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000387 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000387 END
           *> BLOCK-0000388 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000388" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000388 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000388 END
           *> BLOCK-0000389 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000389" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000389 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000389 END
           *> BLOCK-0000390 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000390" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000390 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000390 END
           *> BLOCK-0000391 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000391" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000391 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000391 END
           *> BLOCK-0000392 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000392" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000392 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000392 END
           *> BLOCK-0000393 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000393" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000393 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000393 END
           *> BLOCK-0000394 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000394" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000394 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000394 END
           *> BLOCK-0000395 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000395" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000395 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000395 END
           *> BLOCK-0000396 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000396" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000396 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000396 END
           *> BLOCK-0000397 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000397" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000397 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000397 END
           *> BLOCK-0000398 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000398" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000398 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000398 END
           *> BLOCK-0000399 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000399" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000399 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000399 END
           *> BLOCK-0000400 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000400" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000400 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000400 END
           *> BLOCK-0000401 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000401" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000401 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000401 END
           *> BLOCK-0000402 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000402" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000402 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000402 END
           *> BLOCK-0000403 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000403" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000403 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000403 END
           *> BLOCK-0000404 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000404" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000404 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000404 END
           *> BLOCK-0000405 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000405" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000405 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000405 END
           *> BLOCK-0000406 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000406" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000406 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000406 END
           *> BLOCK-0000407 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000407" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000407 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000407 END
           *> BLOCK-0000408 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000408" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000408 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000408 END
           *> BLOCK-0000409 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000409" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000409 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000409 END
           *> BLOCK-0000410 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000410" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000410 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000410 END
           *> BLOCK-0000411 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000411" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000411 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000411 END
           *> BLOCK-0000412 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000412" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000412 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000412 END
           *> BLOCK-0000413 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000413" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000413 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000413 END
           *> BLOCK-0000414 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000414" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000414 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000414 END
           *> BLOCK-0000415 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000415" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000415 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000415 END
           *> BLOCK-0000416 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000416" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000416 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000416 END
           *> BLOCK-0000417 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000417" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000417 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000417 END
           *> BLOCK-0000418 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000418" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000418 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000418 END
           *> BLOCK-0000419 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000419" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000419 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000419 END
           *> BLOCK-0000420 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000420" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000420 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000420 END
           *> BLOCK-0000421 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000421" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000421 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000421 END
           *> BLOCK-0000422 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000422" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000422 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000422 END
           *> BLOCK-0000423 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000423" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000423 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000423 END
           *> BLOCK-0000424 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000424" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000424 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000424 END
           *> BLOCK-0000425 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000425" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000425 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000425 END
           *> BLOCK-0000426 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000426" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000426 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000426 END
           *> BLOCK-0000427 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000427" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000427 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000427 END
           *> BLOCK-0000428 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000428" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000428 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000428 END
           *> BLOCK-0000429 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000429" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000429 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000429 END
           *> BLOCK-0000430 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000430" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000430 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000430 END
           *> BLOCK-0000431 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000431" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000431 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000431 END
           *> BLOCK-0000432 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000432" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000432 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000432 END
           *> BLOCK-0000433 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000433" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000433 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000433 END
           *> BLOCK-0000434 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000434" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000434 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000434 END
           *> BLOCK-0000435 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000435" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000435 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000435 END
           *> BLOCK-0000436 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000436" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000436 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000436 END
           *> BLOCK-0000437 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000437" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000437 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000437 END
           *> BLOCK-0000438 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000438" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000438 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000438 END
           *> BLOCK-0000439 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000439" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000439 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000439 END
           *> BLOCK-0000440 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000440" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000440 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000440 END
           *> BLOCK-0000441 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000441" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000441 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000441 END
           *> BLOCK-0000442 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000442" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000442 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000442 END
           *> BLOCK-0000443 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000443" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000443 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000443 END
           *> BLOCK-0000444 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000444" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000444 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000444 END
           *> BLOCK-0000445 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000445" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000445 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000445 END
           *> BLOCK-0000446 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000446" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000446 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000446 END
           *> BLOCK-0000447 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000447" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000447 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000447 END
           *> BLOCK-0000448 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000448" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000448 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000448 END
           *> BLOCK-0000449 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000449" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000449 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000449 END
           *> BLOCK-0000450 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000450" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000450 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000450 END
           *> BLOCK-0000451 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000451" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000451 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000451 END
           *> BLOCK-0000452 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000452" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000452 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000452 END
           *> BLOCK-0000453 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000453" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000453 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000453 END
           *> BLOCK-0000454 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000454" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000454 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000454 END
           *> BLOCK-0000455 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000455" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000455 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000455 END
           *> BLOCK-0000456 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000456" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000456 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000456 END
           *> BLOCK-0000457 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000457" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000457 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000457 END
           *> BLOCK-0000458 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000458" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000458 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000458 END
           *> BLOCK-0000459 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000459" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000459 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000459 END
           *> BLOCK-0000460 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000460" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000460 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000460 END
           *> BLOCK-0000461 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000461" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000461 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000461 END
           *> BLOCK-0000462 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000462" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000462 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000462 END
           *> BLOCK-0000463 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000463" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000463 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000463 END
           *> BLOCK-0000464 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000464" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000464 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000464 END
           *> BLOCK-0000465 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000465" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000465 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000465 END
           *> BLOCK-0000466 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000466" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000466 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000466 END
           *> BLOCK-0000467 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000467" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000467 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000467 END
           *> BLOCK-0000468 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000468" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000468 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000468 END
           *> BLOCK-0000469 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000469" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000469 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000469 END
           *> BLOCK-0000470 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000470" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000470 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000470 END
           *> BLOCK-0000471 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000471" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000471 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000471 END
           *> BLOCK-0000472 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000472" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000472 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000472 END
           *> BLOCK-0000473 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000473" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000473 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000473 END
           *> BLOCK-0000474 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000474" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000474 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000474 END
           *> BLOCK-0000475 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000475" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000475 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000475 END
           *> BLOCK-0000476 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000476" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000476 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000476 END
           *> BLOCK-0000477 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000477" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000477 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000477 END
           *> BLOCK-0000478 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000478" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000478 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000478 END
           *> BLOCK-0000479 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000479" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000479 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000479 END
           *> BLOCK-0000480 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000480" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000480 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000480 END
           *> BLOCK-0000481 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000481" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000481 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000481 END
           *> BLOCK-0000482 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000482" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000482 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000482 END
           *> BLOCK-0000483 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000483" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000483 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000483 END
           *> BLOCK-0000484 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000484" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000484 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000484 END
           *> BLOCK-0000485 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000485" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000485 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000485 END
           *> BLOCK-0000486 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000486" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000486 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000486 END
           *> BLOCK-0000487 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000487" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000487 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000487 END
           *> BLOCK-0000488 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000488" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000488 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000488 END
           *> BLOCK-0000489 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000489" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000489 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000489 END
           *> BLOCK-0000490 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000490" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000490 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000490 END
           *> BLOCK-0000491 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000491" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000491 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000491 END
           *> BLOCK-0000492 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000492" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000492 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000492 END
           *> BLOCK-0000493 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000493" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000493 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000493 END
           *> BLOCK-0000494 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000494" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000494 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000494 END
           *> BLOCK-0000495 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000495" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000495 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000495 END
           *> BLOCK-0000496 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000496" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000496 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000496 END
           *> BLOCK-0000497 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000497" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000497 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000497 END
           *> BLOCK-0000498 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000498" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000498 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000498 END
           *> BLOCK-0000499 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000499" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000499 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000499 END
           *> BLOCK-0000500 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000500" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000500 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000500 END
           *> BLOCK-0000501 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000501" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000501 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000501 END
           *> BLOCK-0000502 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000502" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000502 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000502 END
           *> BLOCK-0000503 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000503" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000503 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000503 END
           *> BLOCK-0000504 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000504" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000504 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000504 END
           *> BLOCK-0000505 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000505" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000505 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000505 END
           *> BLOCK-0000506 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000506" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000506 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000506 END
           *> BLOCK-0000507 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000507" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000507 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000507 END
           *> BLOCK-0000508 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000508" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000508 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000508 END
           *> BLOCK-0000509 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000509" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000509 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
           *> BLOCK-0000509 END
           *> BLOCK-0000510 START
           ADD 1 TO WS-COUNTER
           MOVE "BLOCK 0000510" TO WS-DUMMY-TEXT
           DISPLAY "ITERATION 0000510 COUNTER=" WS-COUNTER
           DISPLAY WS-DUMMY-TEXT
           IF WS-COUNTER > 999999
              MOVE 0 TO WS-COUNTER
           END-IF
       FINISH-SECTION.
           MOVE "FINISHING 300K" TO WS-DUMMY-TEXT.
           DISPLAY WS-DUMMY-TEXT.
           DISPLAY "TOTAL ITERATIONS EXECUTED:" WS-COUNTER.
           EXIT.
       END PROGRAM BIGTEST300K.
      *> FILLER-LINE-0299983
      *> FILLER-LINE-0299984
      *> FILLER-LINE-0299985
      *> FILLER-LINE-0299986
      *> FILLER-LINE-0299987
      *> FILLER-LINE-0299988
      *> FILLER-LINE-0299989
      *> FILLER-LINE-0299990
      *> FILLER-LINE-0299991
      *> FILLER-LINE-0299992
      *> FILLER-LINE-0299993
      *> FILLER-LINE-0299994
      *> FILLER-LINE-0299995
      *> FILLER-LINE-0299996
      *> FILLER-LINE-0299997
      *> FILLER-LINE-0299998
      *> FILLER-LINE-0299999
      *> FILLER-LINE-0300000